{
  "backend/main.mo": "Motoko actor defining Project and ContactInfo types with three project category maps (marketing, web dev, social media) and CRUD functions for adding projects and managing contact information.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing a portfolio site with burgundy/pink color scheme, hero section with personal photo, skills grid, portfolio sections, and contact information.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for background, foreground, primary, secondary, and UI component colors.",
  "frontend/index.html": "HTML entry point with page title \"Thanisha Ivana Portfolio\" and root div for React mounting.",
  "frontend/src/App.tsx": "Main React component orchestrating the portfolio layout with Hero, Skills, three Portfolio sections (Marketing, Social Media, Web Dev), Contact, and Footer components using React Query hooks for data fetching.",
  "frontend/src/components/ContactSection.tsx": "Contact section component displaying name, email, phone, and LinkedIn information in a card grid with icons, loading states, and hover effects using data from useContactInfo hook.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice, heart icon, and caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with background image, gradient overlays, \"Thanisha Ivana\" heading with burgundy glow, tagline, CTA buttons for portfolio and contact navigation, and animated scroll indicator.",
  "frontend/src/components/PortfolioSection.tsx": "Reusable portfolio section component rendering project cards in a responsive grid with title, description, external link buttons, loading states, and empty state messaging.",
  "frontend/src/components/SkillsSection.tsx": "Skills section displaying six core competencies (Strategy, Content Creation, Social Media, Analytics, Campaign Management, Growth Marketing) in an animated grid with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor for backend communication, using Internet Identity and React Query with automatic invalidation of dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching marketing projects, social media projects, web dev projects, and contact info from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a burgundy-wine and dusty pink color palette on deep navy-black backgrounds, with separate light and dark mode themes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (burgundy, pink, teal palette), typography plugins, custom fonts (Inter, Outfit, JetBrains Mono), border radius variables, and custom box shadows including burgundy and pink glow effects.",
  "project_state.json": "Project metadata describing Thanisha Ivana's digital marketing portfolio with three work showcase sections, contact area, and purple/black theme derived from a personal background photo, tracking architectural decisions and implemented features."
}