{
  "backend/main.mo": "Motoko actor defining Project and ContactInfo types with three project category maps (marketing, web dev, social media) and CRUD functions for adding projects and managing contact information.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: updating Hero background image, implementing color theme harmonization with image palette, and rendering the uploaded photo as a static asset.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing the steel blue/burgundy/dusty pink color scheme implementation across components, hooks for backend queries, and portfolio layout structure.",
  "frontend/index.css": "Tailwind base layer defining CSS custom properties for light and dark mode color tokens using OKLCH color space with neutral backgrounds and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title \"Thanisha Ivana Portfolio\", and root div mounting the React app from main.tsx.",
  "frontend/src/App.tsx": "Main React component orchestrating the portfolio layout with Hero, Skills, three PortfolioSection instances (marketing, social media, web dev), ContactSection, and Footer components using custom hooks for data fetching.",
  "frontend/src/components/ContactSection.tsx": "Contact section component displaying name, email, phone, and LinkedIn in a card grid with icons, loading states, and hover effects using steel blue glow styling.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright for Thanisha Ivana Portfolio with heart icon and caffeine.ai attribution link including UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with uploaded personal photo background, burgundy gradient overlays, main heading with burgundy glow effect, tagline, CTA buttons with burgundy shadows, and smooth scroll navigation.",
  "frontend/src/components/PortfolioSection.tsx": "Reusable portfolio section component that displays a grid of project cards with title, description, and external links, including loading and empty states.",
  "frontend/src/components/SkillsSection.tsx": "Static skills section component displaying six marketing competencies (Strategy, Content Creation, Social Media, Analytics, Campaign Management, Growth Marketing) in a responsive grid with icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching marketing projects, social media projects, web dev projects, and contact info from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables defining a dark charcoal theme with burgundy primary, steel blue secondary, and dusty pink accent colors for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system (burgundy, steel, dusty palettes), custom fonts (Playfair Display, Inter), animations, and box shadow utilities.",
  "project_state.json": "Project state tracking for Thanisha Ivana's digital marketing portfolio website with purple/black theme and personal photo background. Includes architectural notes, existing features (hero section, portfolio sections, contact area), and recent feature requests for color scheme updates and image integration."
}